app/Controllers/Api/ApiController.php

SELECT *
FROM `produtos`
---
    public function get_produtos()
    {
        $produtoModel = new ProdutoModel();
        $produtos = $produtoModel->findAll();